; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-3-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-1 - location
	p0-2 - location
	p0-9 - location
	p1-3 - location
	p1-6 - location
	p1-7 - location
	p2-3 - location
	p2-8 - location
	p3-4 - location
	p3-10 - location
	p4-2 - location
	p5-4 - location
	p6-2 - location
	p6-3 - location
	p6-12 - location
	p7-10 - location
	p10-5 - location
	p10-9 - location
	p11-0 - location
	p11-2 - location
	p11-4 - location
	p11-10 - location
	p12-0 - location
	p12-2 - location
	)
	(:init
	(at driver1 s12)
	(at driver2 s4)
	(at driver3 s5)
	(at driver4 s0)
	(at driver5 s12)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at package1 s12)
	(at package2 s2)
	(at package3 s0)
	(at package4 s10)
	(at package5 s9)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 48)
	(= (time-to-walk p0-1 s0) 48)
	(= (time-to-walk s1 p0-1) 42)
	(= (time-to-walk p0-1 s1) 42)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 33)
	(= (time-to-walk p0-2 s0) 33)
	(= (time-to-walk s2 p0-2) 66)
	(= (time-to-walk p0-2 s2) 66)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(= (time-to-walk s0 p0-9) 38)
	(= (time-to-walk p0-9 s0) 38)
	(= (time-to-walk s9 p0-9) 44)
	(= (time-to-walk p0-9 s9) 44)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 55)
	(= (time-to-walk p1-3 s1) 55)
	(= (time-to-walk s3 p1-3) 61)
	(= (time-to-walk p1-3 s3) 61)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 53)
	(= (time-to-walk p1-6 s1) 53)
	(= (time-to-walk s6 p1-6) 91)
	(= (time-to-walk p1-6 s6) 91)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 5)
	(= (time-to-walk p1-7 s1) 5)
	(= (time-to-walk s7 p1-7) 40)
	(= (time-to-walk p1-7 s7) 40)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 17)
	(= (time-to-walk p2-3 s2) 17)
	(= (time-to-walk s3 p2-3) 74)
	(= (time-to-walk p2-3 s3) 74)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 12)
	(= (time-to-walk p2-8 s2) 12)
	(= (time-to-walk s8 p2-8) 96)
	(= (time-to-walk p2-8 s8) 96)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 72)
	(= (time-to-walk p3-4 s3) 72)
	(= (time-to-walk s4 p3-4) 85)
	(= (time-to-walk p3-4 s4) 85)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 33)
	(= (time-to-walk p3-10 s3) 33)
	(= (time-to-walk s10 p3-10) 95)
	(= (time-to-walk p3-10 s10) 95)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 50)
	(= (time-to-walk p4-2 s4) 50)
	(= (time-to-walk s2 p4-2) 55)
	(= (time-to-walk p4-2 s2) 55)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 97)
	(= (time-to-walk p5-4 s5) 97)
	(= (time-to-walk s4 p5-4) 14)
	(= (time-to-walk p5-4 s4) 14)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 18)
	(= (time-to-walk p6-2 s6) 18)
	(= (time-to-walk s2 p6-2) 80)
	(= (time-to-walk p6-2 s2) 80)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 15)
	(= (time-to-walk p6-3 s6) 15)
	(= (time-to-walk s3 p6-3) 19)
	(= (time-to-walk p6-3 s3) 19)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(= (time-to-walk s6 p6-12) 51)
	(= (time-to-walk p6-12 s6) 51)
	(= (time-to-walk s12 p6-12) 56)
	(= (time-to-walk p6-12 s12) 56)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(= (time-to-walk s7 p7-10) 77)
	(= (time-to-walk p7-10 s7) 77)
	(= (time-to-walk s10 p7-10) 98)
	(= (time-to-walk p7-10 s10) 98)
	(path s10 p10-5)
	(path p10-5 s10)
	(path s5 p10-5)
	(path p10-5 s5)
	(= (time-to-walk s10 p10-5) 97)
	(= (time-to-walk p10-5 s10) 97)
	(= (time-to-walk s5 p10-5) 10)
	(= (time-to-walk p10-5 s5) 10)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 64)
	(= (time-to-walk p10-9 s10) 64)
	(= (time-to-walk s9 p10-9) 35)
	(= (time-to-walk p10-9 s9) 35)
	(path s11 p11-0)
	(path p11-0 s11)
	(path s0 p11-0)
	(path p11-0 s0)
	(= (time-to-walk s11 p11-0) 53)
	(= (time-to-walk p11-0 s11) 53)
	(= (time-to-walk s0 p11-0) 19)
	(= (time-to-walk p11-0 s0) 19)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(= (time-to-walk s11 p11-2) 95)
	(= (time-to-walk p11-2 s11) 95)
	(= (time-to-walk s2 p11-2) 6)
	(= (time-to-walk p11-2 s2) 6)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 10)
	(= (time-to-walk p11-4 s11) 10)
	(= (time-to-walk s4 p11-4) 100)
	(= (time-to-walk p11-4 s4) 100)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(= (time-to-walk s11 p11-10) 46)
	(= (time-to-walk p11-10 s11) 46)
	(= (time-to-walk s10 p11-10) 26)
	(= (time-to-walk p11-10 s10) 26)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(= (time-to-walk s12 p12-0) 73)
	(= (time-to-walk p12-0 s12) 73)
	(= (time-to-walk s0 p12-0) 57)
	(= (time-to-walk p12-0 s0) 57)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(= (time-to-walk s12 p12-2) 22)
	(= (time-to-walk p12-2 s12) 22)
	(= (time-to-walk s2 p12-2) 45)
	(= (time-to-walk p12-2 s2) 45)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 42)
	(= (time-to-drive s7 s0) 42)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 55)
	(= (time-to-drive s8 s0) 55)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 39)
	(= (time-to-drive s11 s0) 39)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 91)
	(= (time-to-drive s5 s1) 91)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 9)
	(= (time-to-drive s6 s1) 9)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 36)
	(= (time-to-drive s7 s1) 36)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 5)
	(= (time-to-drive s0 s2) 5)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 27)
	(= (time-to-drive s6 s2) 27)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 15)
	(= (time-to-drive s7 s2) 15)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 19)
	(= (time-to-drive s9 s2) 19)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 46)
	(= (time-to-drive s10 s3) 46)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 66)
	(= (time-to-drive s11 s3) 66)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 75)
	(= (time-to-drive s12 s3) 75)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 22)
	(= (time-to-drive s9 s4) 22)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 64)
	(= (time-to-drive s0 s5) 64)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 72)
	(= (time-to-drive s4 s5) 72)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 31)
	(= (time-to-drive s12 s5) 31)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 28)
	(= (time-to-drive s3 s6) 28)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 6)
	(= (time-to-drive s7 s6) 6)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 84)
	(= (time-to-drive s4 s7) 84)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 46)
	(= (time-to-drive s5 s7) 46)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 1)
	(= (time-to-drive s9 s7) 1)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 90)
	(= (time-to-drive s2 s8) 90)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 55)
	(= (time-to-drive s5 s8) 55)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 1)
	(= (time-to-drive s9 s8) 1)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 35)
	(= (time-to-drive s10 s8) 35)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 81)
	(= (time-to-drive s6 s9) 81)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 74)
	(= (time-to-drive s10 s9) 74)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 92)
	(= (time-to-drive s1 s10) 92)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 2)
	(= (time-to-drive s5 s10) 2)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 18)
	(= (time-to-drive s7 s10) 18)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 33)
	(= (time-to-drive s9 s11) 33)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 56)
	(= (time-to-drive s10 s11) 56)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 57)
	(= (time-to-drive s4 s12) 57)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 24)
	(= (time-to-drive s9 s12) 24)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s7)
	(at driver5 s1)
	(at truck1 s1)
	(at truck3 s9)
	(at package1 s9)
	(at package2 s8)
	(at package3 s8)
	(at package5 s5)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver1 s12 p12-0)
   deleted: (at driver1 s12)
   added: (at driver1 p12-0)
   changed: (walked) from 0 to 73
   goals met: 1 of 10
2. (walk driver5 s12 p6-12)
   deleted: (at driver5 s12)
   added: (at driver5 p6-12)
   changed: (walked) from 73 to 129
   goals met: 1 of 10
3. (walk driver5 p6-12 s6)
   deleted: (at driver5 p6-12)
   added: (at driver5 s6)
   changed: (walked) from 129 to 180
   goals met: 1 of 10
4. (walk driver5 s6 p1-6)
   deleted: (at driver5 s6)
   added: (at driver5 p1-6)
   changed: (walked) from 180 to 271
   goals met: 1 of 10
5. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   changed: (walked) from 271 to 356
   goals met: 0 of 10
6. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 0 of 10
7. (walk driver1 p12-0 s12)
   deleted: (at driver1 p12-0)
   added: (at driver1 s12)
   changed: (walked) from 356 to 429
   goals met: 0 of 10
8. (drive-truck truck2 s5 s7 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (driven) from 0 to 46
   goals met: 0 of 10
9. (drive-truck truck2 s7 s9 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   changed: (driven) from 46 to 47
   goals met: 0 of 10
10. (load-truck package5 truck2 s9)
   deleted: (at package5 s9)
   added: (in package5 truck2)
   goals met: 0 of 10
11. (walk driver5 p1-6 s1)
   deleted: (at driver5 p1-6)
   added: (at driver5 s1)
   changed: (walked) from 429 to 482
   goals met: 1 of 10
12. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   changed: (walked) from 482 to 554
   goals met: 1 of 10
13. (drive-truck truck2 s9 s2 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s2)
   changed: (driven) from 47 to 66
   goals met: 1 of 10
14. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 10
15. (drive-truck truck1 s3 s12 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s12)
   changed: (driven) from 66 to 141
   goals met: 1 of 10
16. (load-truck package1 truck1 s12)
   deleted: (at package1 s12)
   added: (in package1 truck1)
   goals met: 1 of 10
17. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 1 of 10
18. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 141 to 146
   goals met: 1 of 10
19. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 1 of 10
20. (drive-truck truck2 s0 s8 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (driven) from 146 to 201
   goals met: 1 of 10
21. (unload-truck package2 truck2 s8)
   deleted: (in package2 truck2)
   added: (at package2 s8)
   goals met: 2 of 10
22. (unload-truck package3 truck2 s8)
   deleted: (in package3 truck2)
   added: (at package3 s8)
   goals met: 3 of 10
23. (drive-truck truck1 s12 s4 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s4)
   changed: (driven) from 201 to 258
   goals met: 3 of 10
24. (drive-truck truck2 s8 s5 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (driven) from 258 to 313
   goals met: 3 of 10
25. (unload-truck package5 truck2 s5)
   deleted: (in package5 truck2)
   added: (at package5 s5)
   goals met: 4 of 10
26. (drive-truck truck2 s5 s8 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (driven) from 313 to 368
   goals met: 4 of 10
27. (drive-truck truck1 s4 s12 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s12)
   changed: (driven) from 368 to 425
   goals met: 4 of 10
28. (disembark-truck driver3 truck2 s8)
   deleted: (driving driver3 truck2)
   added: (at driver3 s8) (empty truck2)
   goals met: 4 of 10
29. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 10
30. (drive-truck truck3 s8 s9 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   changed: (driven) from 425 to 426
   goals met: 5 of 10
31. (drive-truck truck3 s9 s7 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (driven) from 426 to 427
   goals met: 4 of 10
32. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 5 of 10
33. (disembark-truck driver2 truck1 s12)
   deleted: (driving driver2 truck1)
   added: (at driver2 s12) (empty truck1)
   goals met: 5 of 10
34. (board-truck driver1 truck1 s12)
   deleted: (at driver1 s12) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 10
35. (drive-truck truck1 s12 s5 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s5)
   changed: (driven) from 427 to 458
   goals met: 5 of 10
36. (drive-truck truck1 s5 s1 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 458 to 549
   goals met: 6 of 10
37. (walk driver2 s12 p12-2)
   deleted: (at driver2 s12)
   added: (at driver2 p12-2)
   changed: (walked) from 554 to 576
   goals met: 6 of 10
38. (walk driver2 p12-2 s2)
   deleted: (at driver2 p12-2)
   added: (at driver2 s2)
   changed: (walked) from 576 to 621
   goals met: 6 of 10
39. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   changed: (walked) from 621 to 676
   goals met: 6 of 10
40. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   changed: (walked) from 676 to 726
   goals met: 7 of 10
41. (drive-truck truck1 s1 s10 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s10)
   changed: (driven) from 549 to 641
   goals met: 6 of 10
42. (drive-truck truck1 s10 s9 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s9)
   changed: (driven) from 641 to 715
   goals met: 6 of 10
43. (unload-truck package1 truck1 s9)
   deleted: (in package1 truck1)
   added: (at package1 s9)
   goals met: 7 of 10
44. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
45. (drive-truck truck3 s7 s5 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (driven) from 715 to 761
   goals met: 6 of 10
46. (drive-truck truck1 s9 s7 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s7)
   changed: (driven) from 761 to 762
   goals met: 6 of 10
47. (drive-truck truck1 s7 s5 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (driven) from 762 to 808
   goals met: 6 of 10
48. (drive-truck truck3 s5 s12 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s12)
   changed: (driven) from 808 to 839
   goals met: 6 of 10
49. (disembark-truck driver3 truck3 s12)
   deleted: (driving driver3 truck3)
   added: (at driver3 s12) (empty truck3)
   goals met: 6 of 10
50. (drive-truck truck1 s5 s12 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s12)
   changed: (driven) from 839 to 870
   goals met: 6 of 10
51. (drive-truck truck1 s12 s4 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s4)
   changed: (driven) from 870 to 927
   goals met: 6 of 10
52. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 6 of 10
53. (board-truck driver3 truck3 s12)
   deleted: (at driver3 s12) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
54. (drive-truck truck3 s12 s9 driver3)
   deleted: (at truck3 s12)
   added: (at truck3 s9)
   changed: (driven) from 927 to 951
   goals met: 7 of 10
55. (walk driver1 s4 p5-4)
   deleted: (at driver1 s4)
   added: (at driver1 p5-4)
   changed: (walked) from 726 to 740
   goals met: 7 of 10
56. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 10
57. (drive-truck truck3 s9 s7 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (driven) from 951 to 952
   goals met: 5 of 10
58. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 952 to 1024
   goals met: 5 of 10
59. (drive-truck truck1 s5 s1 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 1024 to 1115
   goals met: 6 of 10
60. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 6 of 10
61. (walk driver1 p5-4 s5)
   deleted: (at driver1 p5-4)
   added: (at driver1 s5)
   changed: (walked) from 740 to 837
   goals met: 7 of 10
62. (drive-truck truck3 s7 s1 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (driven) from 1115 to 1151
   goals met: 7 of 10
63. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 7 of 10
64. (walk driver3 s1 p1-7)
   deleted: (at driver3 s1)
   added: (at driver3 p1-7)
   changed: (walked) from 837 to 842
   goals met: 7 of 10
65. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 10
66. (board-truck driver5 truck3 s1)
   deleted: (at driver5 s1) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 6 of 10
67. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 1151 to 1242
   goals met: 5 of 10
68. (drive-truck truck3 s1 s7 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (driven) from 1242 to 1278
   goals met: 5 of 10
69. (walk driver3 p1-7 s7)
   deleted: (at driver3 p1-7)
   added: (at driver3 s7)
   changed: (walked) from 842 to 882
   goals met: 6 of 10
70. (drive-truck truck1 s5 s1 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 1278 to 1369
   goals met: 7 of 10
71. (drive-truck truck3 s7 s4 driver5)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 1369 to 1453
   goals met: 7 of 10
72. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 1453 to 1544
   goals met: 6 of 10
73. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 6 of 10
74. (walk driver2 s5 p5-4)
   deleted: (at driver2 s5)
   added: (at driver2 p5-4)
   changed: (walked) from 882 to 979
   goals met: 6 of 10
75. (walk driver2 p5-4 s4)
   deleted: (at driver2 p5-4)
   added: (at driver2 s4)
   changed: (walked) from 979 to 993
   goals met: 7 of 10
76. (drive-truck truck3 s4 s5 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 1544 to 1616
   goals met: 7 of 10
77. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 10
78. (drive-truck truck3 s5 s12 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s12)
   changed: (driven) from 1616 to 1647
   goals met: 6 of 10
79. (disembark-truck driver5 truck3 s12)
   deleted: (driving driver5 truck3)
   added: (at driver5 s12) (empty truck3)
   goals met: 6 of 10
80. (disembark-truck driver1 truck1 s5)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 7 of 10
81. (walk driver5 s12 p12-0)
   deleted: (at driver5 s12)
   added: (at driver5 p12-0)
   changed: (walked) from 993 to 1066
   goals met: 7 of 10
82. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 10
83. (walk driver5 p12-0 s0)
   deleted: (at driver5 p12-0)
   added: (at driver5 s0)
   changed: (walked) from 1066 to 1123
   goals met: 6 of 10
84. (drive-truck truck1 s5 s12 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s12)
   changed: (driven) from 1647 to 1678
   goals met: 6 of 10
85. (walk driver5 s0 p0-1)
   deleted: (at driver5 s0)
   added: (at driver5 p0-1)
   changed: (walked) from 1123 to 1171
   goals met: 6 of 10
86. (walk driver5 p0-1 s1)
   deleted: (at driver5 p0-1)
   added: (at driver5 s1)
   changed: (walked) from 1171 to 1213
   goals met: 7 of 10
87. (disembark-truck driver1 truck1 s12)
   deleted: (driving driver1 truck1)
   added: (at driver1 s12) (empty truck1)
   goals met: 7 of 10
88. (board-truck driver1 truck3 s12)
   deleted: (at driver1 s12) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 10
89. (drive-truck truck3 s12 s5 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s5)
   changed: (driven) from 1678 to 1709
   goals met: 7 of 10
90. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 8 of 10
91. (walk driver4 s0 p12-0)
   deleted: (at driver4 s0)
   added: (at driver4 p12-0)
   changed: (walked) from 1213 to 1270
   goals met: 8 of 10
92. (walk driver4 p12-0 s12)
   deleted: (at driver4 p12-0)
   added: (at driver4 s12)
   changed: (walked) from 1270 to 1343
   goals met: 8 of 10
93. (board-truck driver4 truck1 s12)
   deleted: (at driver4 s12) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 8 of 10
94. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 10
95. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 1709 to 1781
   goals met: 7 of 10
96. (drive-truck truck3 s4 s9 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   changed: (driven) from 1781 to 1803
   goals met: 8 of 10
97. (disembark-truck driver1 truck3 s9)
   deleted: (driving driver1 truck3)
   added: (at driver1 s9) (empty truck3)
   goals met: 8 of 10
98. (drive-truck truck1 s12 s5 driver4)
   deleted: (at truck1 s12)
   added: (at truck1 s5)
   changed: (driven) from 1803 to 1834
   goals met: 8 of 10
99. (drive-truck truck1 s5 s1 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 1834 to 1925
   goals met: 9 of 10
100. (walk driver1 s9 p10-9)
   deleted: (at driver1 s9)
   added: (at driver1 p10-9)
   changed: (walked) from 1343 to 1378
   goals met: 9 of 10
101. (walk driver1 p10-9 s10)
   deleted: (at driver1 p10-9)
   added: (at driver1 s10)
   changed: (walked) from 1378 to 1442
   goals met: 9 of 10
102. (walk driver1 s10 p10-5)
   deleted: (at driver1 s10)
   added: (at driver1 p10-5)
   changed: (walked) from 1442 to 1539
   goals met: 9 of 10
103. (walk driver1 p10-5 s5)
   deleted: (at driver1 p10-5)
   added: (at driver1 s5)
   changed: (walked) from 1539 to 1549
   goals met: 10 of 10
